app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" ORDER BY "blogs"."id" ASC LIMIT $1  [["LIMIT", 5]]
---
  def all_blogs
    respond_with params[:count].present? ? Blog.all.first(params[:count]) : Blog.all

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def comments
    blog = Blog.find(params[:id])

INSERT INTO "blogs" ("author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "abcd"], ["content", "hello"], ["created_at", 2016-11-04 03:25:02 UTC], ["updated_at", 2016-11-04 03:25:02 UTC]]
---
  def create
    @blog = Blog.new(blog_params)
    if @blog.save

UPDATE "blogs" SET "author" = $1, "content" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["author", "3"], ["content", "4"], ["updated_at", 2016-11-04 09:09:05 UTC], ["id", 17]]
---
  def update
    if @blog.update(blog_params)

DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 13]]
---
  def destroy
    respond_with @blog.destroy