app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "1234"], ["blog_id", 17], ["created_at", 2016-11-26 09:51:56 UTC], ["updated_at", 2016-11-26 09:51:56 UTC]]
---
  def create
    comment = Comment.new(comment_params)
    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "hello 12"], ["updated_at", 2016-11-26 09:15:58 UTC], ["id", 1]]
---
  def update
    comment = Comment.find(params[:id])
    if comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def delete
    comment = Comment.find(params[:id])
    respond_with comment.destroy